name: "ensemble"
platform: "ensemble"
max_batch_size: 64
input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT"
      }
      output_map {
        key: "OUTPUT_0"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "yolo_detection"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_image"
      }
      output_map {
        key: "output0"
        value: "OUTPUT_YOLO"
      }
    },
    {
      model_name: "optical_character_recognition"
      model_version: -1
      input_map [
        {
        key: "INPUT_0"
        value: "OUTPUT_YOLO"
        },
        {
          key: "INPUT_1"
          value: "INPUT"
        }
      ]
      output_map {
        key: "OUTPUT_0"
        value: "OUTPUT"
      }
    }
  ]
}
